communication/02_client_soap_outbound.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<Action xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-15165035">http://apache.org/hello_world_soap_http/Greeter/greetMeRequest
		</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-29538465">urn:uuid:06f41687-bec5-4169-b107-e79efe69e243</MessageID>
		<To xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-32299982">http://localhost:9001/SoapContext/SoapPort</To>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-22202345">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<wsu:Timestamp wsu:Id="TS-9">
				<wsu:Created>2013-09-04T07:24:29.327Z</wsu:Created>
				<wsu:Expires>2013-09-04T07:29:29.327Z</wsu:Expires>
			</wsu:Timestamp>
			<saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
				xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
				ID="_CE19E68ECA663EC06213782794690301" IssueInstant="2013-09-04T07:24:29.030Z"
				Version="2.0" xsi:type="saml2:AssertionType">
				<saml2:Issuer>D
					oubleItSTSIssuer
				</saml2:Issuer>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod
							Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
						<ds:Reference URI="#_CE19E68ECA663EC06213782794690301">
							<ds:Transforms>
								<ds:Transform
									Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
									<ec:InclusiveNamespaces
										xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xs" />
								</ds:Transform>
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
							<ds:DigestValue>EeHzgoNohbrT3
								diR5JDCogRS5uk=
							</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>hz0JzicZhAEhOT4h11
						Bk0WrxW3OyQ3+c/6dFbApnMtDEHj0OmK+isqXKSablineHYE6OclJBpI3ZMgtXeX/NBrmfmpsSc81pruGlk5BiQWyMRuyDG6LYim
						isz2psE4Uzi5W6OZAKMJzb96IDGXVF7AxA1U9Op32omhRmxoYL7l0=
					</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:X509Data>
							<ds:X509Certificate>MIID5jCCA0+gAwIBAgIJAPahVdM2UPibMA0GCSqGSIb3DQEBBQUAMIGpMQswCQYDVQQGEwJVUzER
								MA8GA1UECBMITWFyeWxhbmQxEjAQBgNVBAcTCUJhbHRpbW9yZTEpMCcGA1UEChMgU2FtcGxlIFNU
								UyAtLSBOT1QgRk9SIFBST0RVQ1RJT04xFjAUBgNVBAsTDUlUIERlcGFydG1lbnQxFDASBgNVBAMT
								C3d3dy5zdHMuY29tMRowGAYJKoZIhvcNAQkBFgtzdHNAc3RzLmNvbTAeFw0xMTAyMDkxODM4MTNa
								Fw0yMTAyMDYxODM4MTNaMIGpMQswCQYDVQQGEwJVUzERMA8GA1UECBMITWFyeWxhbmQxEjAQBgNV
								BAcTCUJhbHRpbW9yZTEpMCcGA1UEChMgU2FtcGxlIFNUUyAtLSBOT1QgRk9SIFBST0RVQ1RJT04x
								FjAUBgNVBAsTDUlUIERlcGFydG1lbnQxFDASBgNVBAMTC3d3dy5zdHMuY29tMRowGAYJKoZIhvcN
								AQkBFgtzdHNAc3RzLmNvbTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAo+f8gs4WcteLdSPW
								Pm8+ciyEz7zVmA7kcCGFQQvlO0smxRViWJ1x+yniT5Uu86UrAQjxRJyANBomQrirfE7KPrnCm6iV
								OsGDEntuIZAf7DFPnrv5p++jAZQuR3vm4ZHXFOFTXmI+/FD5AqLfNi17xiTxZCDYyDdD39CNFTrB
								2PkCAwEAAaOCARIwggEOMB0GA1UdDgQWBBRa0A38holQIbJMFW7m5ZSw+iVDHDCB3gYDVR0jBIHW
								MIHTgBRa0A38holQIbJMFW7m5ZSw+iVDHKGBr6SBrDCBqTELMAkGA1UEBhMCVVMxETAPBgNVBAgT
								CE1hcnlsYW5kMRIwEAYDVQQHEwlCYWx0aW1vcmUxKTAnBgNVBAoTIFNhbXBsZSBTVFMgLS0gTk9U
								IEZPUiBQUk9EVUNUSU9OMRYwFAYDVQQLEw1JVCBEZXBhcnRtZW50MRQwEgYDVQQDEwt3d3cuc3Rz
								LmNvbTEaMBgGCSqGSIb3DQEJARYLc3RzQHN0cy5jb22CCQD2oVXTNlD4mzAMBgNVHRMEBTADAQH/
								MA0GCSqGSIb3DQEBBQUAA4GBACp9yK1I9r++pyFT0yrcaV1m1Sub6urJH+GxQLBaTnTsaPLuzq2g
								IsJHpwk5XggB+IDe69iKKeb74Vt8aOe5usIWVASgi9ckqCwdfTqYu6KG9BlezqHZdExnIG2v/cD/
								3NkKr7O/a7DjlbE6FZ4G1nrOfVJkjmeAa6txtYm1Dm/f
							</ds:X509Certificate>
						</ds:X509Data>
					</ds:KeyInfo>
				</ds:Signature>
				<saml2:Subject>
					<saml2:NameID
						Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified"
						NameQualifier="http://cxf.apache.org/sts">alice</saml2:NameID>
					<saml2:SubjectConfirmation
						Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml2:SubjectConfirmationData
							xsi:type="saml2:KeyInfoConfirmationDataType">
							<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
								<ds:X509Data>
									<ds:X509Certificate>
										MIIEFjCCA3+gAwIBAgIJAJORWX2Xsa8DMA0GCSqGSIb3DQEBBQUAMIG5MQswCQYDVQQGEwJVUzER
										MA8GA1UECBMITmV3IFlvcmsxFjAUBgNVBAcTDU5pYWdhcmEgRmFsbHMxLDAqBgNVBAoTI1NhbXBs
										ZSBDbGllbnQgLS0gTk9UIEZPUiBQUk9EVUNUSU9OMRYwFAYDVQQLEw1JVCBEZXBhcnRtZW50MRcw
										FQYDVQQDEw53d3cuY2xpZW50LmNvbTEgMB4GCSqGSIb3DQEJARYRY2xpZW50QGNsaWVudC5jb20w
										HhcNMTEwMjA5MTgzMDI3WhcNMjEwMjA2MTgzMDI3WjCBuTELMAkGA1UEBhMCVVMxETAPBgNVBAgT
										CE5ldyBZb3JrMRYwFAYDVQQHEw1OaWFnYXJhIEZhbGxzMSwwKgYDVQQKEyNTYW1wbGUgQ2xpZW50
										IC0tIE5PVCBGT1IgUFJPRFVDVElPTjEWMBQGA1UECxMNSVQgRGVwYXJ0bWVudDEXMBUGA1UEAxMO
										d3d3LmNsaWVudC5jb20xIDAeBgkqhkiG9w0BCQEWEWNsaWVudEBjbGllbnQuY29tMIGfMA0GCSqG
										SIb3DQEBAQUAA4GNADCBiQKBgQDauFNVqi4B2+u/PC9ktDkn82bglEQYcL4o5JRUhQVEhTK2iElo
										z1Rvo/qyfDhBPc1lzIUn4ams+DKBSSjZMCgop3XbeCXzIVP784ruC8HF5QrYsXUQfTc7lzqafXZX
										H8Bk89gSScA1fFme6TpvYzM0zjBETSXADtKOs9oKB2VOIwIDAQABo4IBIjCCAR4wHQYDVR0OBBYE
										FFIz+0BSZlLtXkA/udRjRgphtREuMIHuBgNVHSMEgeYwgeOAFFIz+0BSZlLtXkA/udRjRgphtREu
										oYG/pIG8MIG5MQswCQYDVQQGEwJVUzERMA8GA1UECBMITmV3IFlvcmsxFjAUBgNVBAcTDU5pYWdh
										cmEgRmFsbHMxLDAqBgNVBAoTI1NhbXBsZSBDbGllbnQgLS0gTk9UIEZPUiBQUk9EVUNUSU9OMRYw
										FAYDVQQLEw1JVCBEZXBhcnRtZW50MRcwFQYDVQQDEw53d3cuY2xpZW50LmNvbTEgMB4GCSqGSIb3
										DQEJARYRY2xpZW50QGNsaWVudC5jb22CCQCTkVl9l7GvAzAMBgNVHRMEBTADAQH/MA0GCSqGSIb3
										DQEBBQUAA4GBAEjEr9QfaYsZf7ELnqB++OkWcKxpMt1Yj/VOyL99AekkVTM+rRHCU9Bu+tncMNsf
										y8mIXUC1JqKQ+Cq5RlaDh/ujzt6i17G7uSGd6U1U/DPZBqTm3Dxwl1cMAGU/CoAKTWE+o+fS4Q2x
										Hv7L1KiXQQc9EWJ4C34Ik45fB6g3DiTj
									</ds:X509Certificate>
								</ds:X509Data>
							</ds:KeyInfo>
						</saml2:SubjectConfirmationData>
					</saml2:SubjectConfirmation>
				</saml2:Subject>
				<saml2:Conditions NotBefore="2013-09-04T07:24:29.093Z"
					NotOnOrAfter="2013-09-04T07:54:29.093Z">
					<saml2:AudienceRestriction>
						<saml2:Audience>http://localhost:9001/SoapContext/SoapPort
						</saml2:Audience>
					</saml2:AudienceRestriction>
				</saml2:Conditions>
				<saml2:AttributeStatement>
					<saml2:Attribute Name="token-requestor" NameFormat="http://cxf.apache.org/sts">
						<saml2:AttributeValue xsi:type="xs:string">authenticated
						</saml2:AttributeValue>
					</saml2:Attribute>
				</saml2:AttributeStatement>
			</saml2:Assertion>
			<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
				Id="EK-FDAAB3AADBF82F327813782794693427">
				<xenc:EncryptionMethod
					Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p" />
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference>
						<ds:X509Data>
							<ds:X509IssuerSerial>
								<ds:X509IssuerName>1.2.840.113549.1.9.1=#
									16137365727669636540736572766963652e636f6d,CN=www.service.com,OU=IT
									Department,O=Sample Web Service
									Provider -- NOT FOR PRODUCTION,L=Buffalo,ST=New York,C=US
								</ds:X509IssuerName>
								<ds:X509SerialNumber>13
									439384057678826227
								</ds:X509SerialNumber>
							</ds:X509IssuerSerial>
						</ds:X509Data>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>AdXYXvDA41S0sKPfP06XKWjP9AgYcNvcQrbIXxjs/5GuLa
						jEsWGM2WCfQuYBpaK/g2457q8BVuI3qUXlSMB6lP8P4Sg6gSDRQi8ADQDPbIKJ5F+BHudgEFF1FueYv5pEcglhcCdgSxRDY3Xbkn
						x0wUaO3uBGtoY6QiqtzOQ9N3U=
					</xenc:CipherValue>
				</xenc:CipherData>
				<xenc:ReferenceList>
					<xenc:DataReference URI="#ED-11" />
				</xenc:ReferenceList>
			</xenc:EncryptedKey>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
				Id="SIG-10">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
							PrefixList="soap" />
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#TS-9">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces
									xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse soap" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>jNMmIt5rJhkx8fAvb1fT1g7PUCU=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#Id-2920740">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces
									xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>P0xB0rOM85V8w2yFDjfz2bHfGdM=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#Id-32299982">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces
									xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>
							rSbepXB/9SAWI0PFLEWVwhe+Hmo=
						</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#Id-22202345">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces
									xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>DEPHHvvus/tCTTdik5mxt7r3wXE=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#Id-29538465">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces
									xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>I4BSYAIVQhNmmQSkkdOXwTJME 3M=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#Id-15165035">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces
									xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>
							i/8tT8/OzpXWTESAlRZDRu716Ec=
						</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>h4rrUGAqdYYV3KvuRoejKEq/jNwu0G8K9DMrzN8WsNp2tM
					Ebuk56jwDpZ8v22HwMgAlcuTNKl5oeWd15utlOSFHxDZQ07hYsN4S2BevcKuECJU5g1Zq7JpBnRVkiybxQxKVFhET30YBW55qLnL
					it/UjdOOtUhhngHfuHDlufjGU=
				</ds:SignatureValue>
				<ds:KeyInfo Id="KI-FDAAB3AADBF82F327813782794693276">
					<ns3:SecurityTokenReference
						xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
						xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
						wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
						<ns3:KeyIdentifier
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">
							_CE19E68ECA663EC06213782794690301
						</ns3:KeyIdentifier>
					</ns3:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</soap:Header>
	<soap:Body
		xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
		wsu:Id="Id-2920740">
		<xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
			Id="ED-11" Type="http://www.w3.org/2001/04/xmlenc#Content">
			<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc" />
			<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<wsse:SecurityTokenReference
					xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
					xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
					wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey">
					<wsse:Reference URI="#EK-FDAAB3AADBF82F327813782794693427" />
				</wsse:SecurityTokenReference>
			</ds:KeyInfo>
			<xenc:CipherData>
				<xenc:CipherValue>YLQPCF7S2gVJSrBfw488UXeoc5xWiW
					Qu8oTWw9N3BYbdykgGwu/IGQbBe0unh4xENXlIihhB60zF7iikp9fBV2ocnupOYevBPuyHj0WMzncEhearNKPkRoL0LtgapRAR/L
					XtYWYtexIkB63Zv7Ie2p8cI8dLLbJohzsEdNasBtE=
				</xenc:CipherValue>
			</xenc:CipherData>
		</xenc:EncryptedData>
	</soap:Body>
</soap:Envelope>